semestre_i/aag/aula_um/aula1.tex
% Created 2018-08-13 Mon 11:22
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Gustavo de Paula\\ \texttt{\href{mailto:gustavodepaula@disroot.org}{gustavodepaula@disroot.org}}}
\input{structure.tex}
\usepackage[portuguese, ]{babel}
\date{\today}
\title{AAG: Questões, Aula \#1}
\hypersetup{
 pdfauthor={Gustavo de Paula},
 pdftitle={AAG: Questões, Aula \#1},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.13)}, 
 pdflang={Breton}}
\begin{document}

\maketitle
\tableofcontents


\section{O que é produtividade e como se obtém?}
\label{sec:orgcaa9285}
Produtividade é a relação entre o quanto e a qualidade do que foi produzido e o
valor e quantidade dos recursos aplicados na produção.
Para se obter produtividade é necessário aumentar a quantidade e a qualidade do
que é produzido por unidade de recurso consumida.
Para se obter uma maior produtividade, pode se melhorar a performance, cortar
custos, e aumentar a eficiência e eficácia da produção.

\section{O que é fordismo e economia de escala?}
\label{sec:org7ce1724}
\subsection{Fordismo}
\label{sec:org05f3ef6}
Fordismo é um modo de produção que faz uso do sistema de linha de produção para
atingir três objetivos principais: intensificação (dinamismo do tempo de
produção), economia (manutenção da produção equilibrada com seus estoques),
produtividade (extrair o máximo da mão de obra de cada trabalhador).

\subsection{Economia de escala}
\label{sec:orgabc5e17}
Podemos dizer que há economia de escala quando a expansão da capacidade de
produção provoca um aumento no total na quantidade produzida sem aumento
proporcional ou linear nos custos de produção.

\section{Como se obtém produtividade no desenvolvimento de software?}
\label{sec:org3d3fd8b}
Não há consenso sobre como se obtém produtividade no desenvolvimento de
software. Porém, ao se conversar com alguns gerentes de produto, alguns pontos
foram levantados:
\begin{itemize}
\item Metas: o time de desenvolvimento deve estar claro do que é esperado
\item Autonomia: o time deve ser livre para trabalhar em cima do prazo e propostas
acordadas
\item Comunicação: é necessário haver uma clara comunicação entre todas as partes
envolvidas na entrega do produto.
\end{itemize}

\section{Como é uma fábrica de software?}
\label{sec:org6a6c0b4}
Uma fábrica de software é uma empresa que não tem um produto próprio e presta
consultoria e desenvolvimento, este último principalmente para empresas pequenas
que não possuem um time de desenvolvimento.

\section{Metodologia de desenvolvimento de software. Quais são e como são?}
\label{sec:org559cf9d}
Há varias metodologias de desenvolvimento de software, os mais relevantes hoje
são divididos nas seguintes categorias:
\subsection{Iterativas (ágeis)}
\label{sec:orged61b1d}
As metodologias de desenvolvimento ágil são aquelas que fazem usos de iterações
ou \emph{sprints}. Cada iteração dura de uma a quatro semanas. Em uma sprint, o time
passa por todas as fases de desenvolvimento (análises, design, programação e
teste) e no final, o resultado é apresentado à stakeholders e clientes que podem
dar feedback antes do sistema como todo estar pronto.

\subsection{Cascata (waterfall)}
\label{sec:org0dfa827}
As metodologias de desenvolvimento em cascata são aquelas onde o desenvolvimento
é feito linearmente separados em várias fases, com pouca flexibilidade e
iteração. As fases de um desenvolvimento em cascata costumam ser divididas nas
seguintes fases:
\begin{itemize}
\item Documentação dos requerimentos do produto
\item Análise, onde modelos e regras de negócios são resultados
\item Design, onde a arquitetura do software é feita
\item Programação, onde o desenvolvimento é feito
\item Teste, onde há o descobrimento e conserto de bugs
\item Operação, onde há a instalação, suporte e manutenção do sistema
\end{itemize}
\end{document}
